
//主页面数据
function mainData(){
  var data={
    "path":"../images/11.jpg",
    "subtitle":{
      "path":"../images/22.png",
      "sub_content":[
        "互助包含胃癌、肝癌等各种癌症", "9元加入互助计划一人患病，众人分摊","一人患病,众人分摊"
      ]
    },
    "list":[
      {
        "id":"1",
        "path":"../images/66.png",
        "section_cont_sub":"少儿健康互助计划",
        "section_cont_price":"呵护还在，9元加入最高可获捐30万",
        "section_cont_kind":"白血病、癌症等50种大病",
        "range":"出生后30天-17周岁",
        "bindTap":"bind_children"
      }, {
        "id": "2",
        "path": "../images/44.png",
        "section_cont_sub": "中青年抗癌计划",
        "section_cont_price": "关爱自己，9元加入最高可获捐30万",
        "section_cont_kind": "胃癌、肝癌等等各种癌症",
        "range": "18-50周岁",
        "bindTap": "bind_young"
      }, {
        "id": "3",
        "path": "../images/55.png",
        "section_cont_sub": "中老年抗癌计划",
        "section_cont_price": "孝敬父母，9元加入最高可获得10万",
        "section_cont_kind": "胃癌、肝癌等等各种癌症",
        "range": "51-65周岁",
        "bindTap": "bind_old"
      }
    ]
  }
  return data
}

function intro1Data(param){
  console.log("param"+param);
  var data;
  if (param==1){
    data = {
      "path": "../images/intro1.jpg",
      "pathBZ": "../images/service.jpg",//服务保障图片
      "joinData": {
        "showNum": 1231231,
        "showPhoto": "最新加入"
      },
      "list": [
        {
          id: '1',
          left: ' 加入条件',
          right: ' 出生后30天-17周岁，身体健康',
          open: false,
          contents: ['1、加入年龄:出生后30天-17周岁。', '2、受助年龄:出生后30天-17周岁,年满18周岁后将自动转入中青年抗癌计划,继续享受受助资格。', '3、为保障公平性,加入者还需要保证加入计划时身体健康。', '4、认同并承若《会员公约》及计划条款。']
        }, {
          id: '2',
          left: ' 事业范围',
          right: ' 胃癌、肝癌等各种癌症',
          open: false,
          contents: ['涵盖恶性肿瘤,(俗称癌症,包含白血病)、良性脑肿瘤、严重烧伤、重大器官移植、双耳失聪、双目失明等50种重大疾病。']
        }, {
          id: '3',
          left: ' 最高获捐',
          right: ' 30万元',
          open: false,
          contents: ['<view>adasda</view>']
        }, {
          id: '4',
          left: '分摊规则',
          right: ' 单次不超过3元,每年约150元',
          open: false,
          pages: ['navigator']
        }, {
          id: '5',
          left: '余额要求',
          right: ' 账户余额不低于1元即可',
          open: false,
          pages: ['image', 'audio', 'video']
        }, {
          id: '6',
          left: '等待期',
          right: ' 180天（为防止带病加入）',
          pages: ['map']
        }
      ],
      "quesList": [
        {
          id: '11',
          left: 'Q1 若遇到不幸怎么申请互助?',
          open: false,
          contents: [
            '可拨打客户电话400-686-1179申请互助资金。处理流程如下:',
            '(1) 客服了解并登记你的申请;',
            '(2) 水滴互助委托第三方专业公估机构（如商宝通等）核实事件真实性。'
          ]
        },
        {
          id: '22',
          left: 'Q2 小孩还没有身份证,怎么加入?',
          open: false,
          contents: [
            '可拨打客户电话400-686-1179申请互助资金。处理流程如下:',
            '(1) 客服了解并登记你的申请;',
            '(2) 水滴互助委托第三方专业公估机构（如商宝通等）核实事件真实性。'
          ]
        },
        {
          id: '33',
          left: 'Q3 快到17岁了加入后还能延续多久?',
          open: false,
          contents: [
            '可拨打客户电话400-686-1179申请互助资金。处理流程如下:',
            '(1) 客服了解并登记你的申请;',
            '(2) 水滴互助委托第三方专业公估机构（如商宝通等）核实事件真实性。'
          ]
        }, {
          id: '44',
          left: 'Q4 水滴互助是保险吗?',
          open: false,
          contents: [
            '可拨打客户电话400-686-1179申请互助资金。处理流程如下:',
            '(1) 客服了解并登记你的申请;',
            '(2) 水滴互助委托第三方专业公估机构（如商宝通等）核实事件真实性。'
          ]
        }
      ],
      "provison": "《公约条款》 《少年健康互助计划条款》 《健康要求》"
    }
  }else if(param==2){
    data = {
      "path": "../images/intro1.jpg",
      "pathBZ": "../images/service.jpg",//服务保障图片
      "joinData": {
        "showNum": 142131,
        "showPhoto": "最新加入"
      },
      "list": [
        {
          id: '1',
          left: ' 加入条件',
          right: ' 18-50周岁,身体健康',
          open: false,
          contents: ['1、加入年龄:18-50周岁。', '2、受助年龄:18-50周岁,年满51周岁后将自动转入中老年抗癌计划,继续享受受助资格。', '3、为保障公平性,加入者还需要保证加入计划时身体健康。', '4、认同并承若《会员公约》及计划条款。']
        }, {
          id: '2',
          left: ' 事业范围',
          right: ' 胃癌、肝癌等各种癌症',
          open: false,
          contents: ['所有恶性肿瘤（癌症）,但下列疾病不可互助:','(1) 原位癌及癌前病变;','(2) 相当于Binet分期方案A期程度的慢性淋巴细胞白血病;','(3) 相当于 Ann Arbor分期方案1期程度的何杰金氏病;','(4) 皮肤癌（不包括恶性黑色素瘤及已发生转移的皮肤病）;','(5)TNN分期为T1N0M0期或者更轻分期的前列腺癌;','(6) 感染艾滋病病毒或者患艾滋病期间所患恶性肿瘤。']
        }, {
          id: '3',
          left: ' 最高获捐',
          right: ' 30万元',
          open: false,
          contents: ['']
        }, {
          id: '4',
          left: '分摊规则',
          right: ' 单次不超过3元,每年约150元',
          open: false,
          pages: ['navigator']
        }, {
          id: '5',
          left: '余额要求',
          right: ' 账户余额不低于1元即可',
          open: false,
          pages: ['image', 'audio', 'video']
        }, {
          id: '6',
          left: '等待期',
          right: ' 180天（为防止带病加入）',
          contents: ['设置等待期的目的是为了防止已患病或者即将患病的人加入，即常说的逆选择。']
        }
      ],
      "quesList": [
        {
          id: '11',
          left: 'Q1 若遇到不幸怎么申请互助?',
          open: false,
          contents: [
            '可拨打客户电话400-686-1179申请互助资金。处理流程如下:',
            '(1) 客服了解并登记你的申请;',
            '(2) 水滴互助委托第三方专业公估机构（如商宝通等）核实事件真实性。'
          ]
        },
        {
          id: '22',
          left: 'Q3 快到50岁了加入后还能延续多久?',
          open: false,
          contents: [
            '可拨打客户电话400-686-1179申请互助资金。处理流程如下:',
            '(1) 客服了解并登记你的申请;',
            '(2) 水滴互助委托第三方专业公估机构（如商宝通等）核实事件真实性。'
          ]
        }, {
          id: '33',
          left: 'Q4 水滴互助是保险吗?',
          open: false,
          contents: [
            '可拨打客户电话400-686-1179申请互助资金。处理流程如下:',
            '(1) 客服了解并登记你的申请;',
            '(2) 水滴互助委托第三方专业公估机构（如商宝通等）核实事件真实性。'
          ]
        }
      ],
      "provison": "《会员公约》 《中青年抗癌计划条款》 《健康要求》"
    }
  }else{
    data = {
      "path": "../images/intro1.jpg",
      "pathBZ": "../images/service.jpg",//服务保障图片
      "joinData": {
        "showNum": 222222,
        "showPhoto": "最新加入"
      },
      "list": [
        {
          id: '1',
          left: ' 加入条件',
          right: ' 51-65周岁,身体健康',
          open: false,
          contents: ['1、加入年龄:51-65周岁。', '2、受助年龄:51-65周岁,年龄超过65周岁后，只要账户不低于1元即可持续享受受助资格。', '3、为保障公平性,加入者还需要保证加入计划时身体健康。', '4、认同并承若《会员公约》及计划条款。']
        }, {
          id: '2',
          left: ' 事业范围',
          right: ' 胃癌、肝癌等各种癌症',
          open: false,
          contents: ['所有恶性肿瘤（癌症）,但下列疾病不可互助:', '(1) 原位癌及癌前病变;', '(2) 相当于Binet分期方案A期程度的慢性淋巴细胞白血病;', '(3) 相当于 Ann Arbor分期方案1期程度的何杰金氏病;', '(4) 皮肤癌（不包括恶性黑色素瘤及已发生转移的皮肤病）;', '(5)TNN分期为T1N0M0期或者更轻分期的前列腺癌;', '(6) 感染艾滋病病毒或者患艾滋病期间所患恶性肿瘤。']
        }, {
          id: '3',
          left: ' 最高获捐',
          right: ' 30万元',
          open: false,
          contents: ['']
        }, {
          id: '4',
          left: '分摊规则',
          right: ' 单次不超过3元,每年约150元',
          open: false,
          pages: ['navigator']
        }, {
          id: '5',
          left: '余额要求',
          right: ' 账户余额不低于1元即可',
          open: false,
          pages: ['image', 'audio', 'video']
        }, {
          id: '6',
          left: '等待期',
          right: ' 180天（为防止带病加入）',
          contents: ['设置等待期的目的是为了防止已患病或者即将患病的人加入，即常说的逆选择。']
        }
      ],
      "quesList": [
        {
          id: '11',
          left: 'Q1 若遇到不幸怎么申请互助?',
          open: false,
          contents: [
            '可拨打客户电话400-686-1179申请互助资金。处理流程如下:',
            '(1) 客服了解并登记你的申请;',
            '(2) 水滴互助委托第三方专业公估机构（如商宝通等）核实事件真实性。'
          ]
        },
        {
          id: '22',
          left: 'Q2 快到65岁了加入后还能延续多久?',
          open: false,
          contents: [
            '本计划加入年龄为51-65周岁，包含51周岁和65周岁。如果父母今年65周岁，可以放心加入。',
            '之后，只要账户余额不低于1元，即使年龄超过65周岁也可以一直享有互助资格。'
          ]
        }, {
          id: '33',
          left: 'Q3 水滴互助是保险吗?',
          open: false,
          contents: [
            '水滴互助不是保险，而是会员之间互帮互助的公益行动。加入互助社群后，当互助事情发生时，其他会员向符合互助条件的会员进行单向赠与。会员预存金额不是保险费，不能预期获得确定的风险保障回报。',
            '',
            ''
          ]
        }
      ],
      "provison": "《会员公约》 《中老年抗癌计划条款》 《健康要求》"
    }
  }
   return data
}

function healthData(param){
  var data;

  if(param==1){
    data={
      "list1":{
          "title": " 少儿健康互助计划",
          "subtitle": "白血病、癌症等50种大病",
          "item_title": "",
          "item_con": "  为加入本计划，您需要查看被保障人是否符合加入要求。" +
          "若不符合以下要求，将不能加入计划。若您未如实告知其中任何一项情况，将来申请互助时，运营方将按规定拒绝您的申请。"
        }
      ,
      "title":"健康要求"
      ,
      "list2":[
        {
        "id":1,
        "item_title": " 一、过去三年内，未曾因疾病进行手术治疗，或连续住院≧15天,或服药≧3个月;",
        "item_con": ""
        },
        {
          "id": 2,
          "item_title": "  二、目前或既往未患有以下重大疾病:",
          "item_con": " 肿瘤（包括恶性肿瘤、脑部肿瘤、白血病,但已经确诊为良性息肉、囊肿、结节和赘生物且已经治愈的外）、病理学描述为癌前病变的肿瘤、脑血管疾病、冠心病、心肌病、主动脉、急/慢性肾炎、慢性阻塞性肺疾病、支气管哮喘。"
        },
        {
          "id": 3,
          "item_title": "三、过去六个月，未曾出现下列不明原因的症状或不适:",
          "item_con": " 体重减轻超过5公斤（非健身或减肥原因）、不明原因的出血点或者淤块、反复鼻或牙龈出血,身体出现肿块、包块、结节、咯血、便血、血尿、淋巴结肿大，经检查显示需要进一步的检查、治疗或随访。"
        }
      ]
    }
  }else if(param==2){
    data = {
      "list1": {
        "title": " 中青年抗癌计划",
        "subtitle": "胃癌、肝癌等各种癌症",
        "item_title": "",
        "item_con": "  为加入本计划，您需要查看被保障人是否符合加入要求。" +
        "若不符合以下要求，将不能加入计划。若您未如实告知其中任何一项情况，将来申请互助时，运营方将按规定拒绝您的申请。"
      }
      ,
      "title": "健康要求"
      ,
      "list2": [
        {
          "id": 1,
          "item_title": " 一、过去三年内，未曾因疾病进行手术治疗，或连续住院≧15天,或服药≧3个月;",
          "item_con": ""
        },
        {
          "id": 2,
          "item_title": "  二、目前或既往未患有以下重大疾病:",
          "item_con": " 肿瘤（包括恶性肿瘤、脑部肿瘤、白血病,但已经确诊为良性息肉、囊肿、结节和赘生物且已经治愈的外）、病理学描述为癌前病变的肿瘤、脑血管疾病、冠心病、心肌病、主动脉、急/慢性肾炎、慢性阻塞性肺疾病、支气管哮喘。"
        },
        {
          "id": 3,
          "item_title": "三、过去六个月，未曾出现下列不明原因的症状或不适:",
          "item_con": " 体重减轻超过5公斤（非健身或减肥原因）、不明原因的出血点或者淤块、反复鼻或牙龈出血,身体出现肿块、包块、结节、咯血、便血、血尿、淋巴结肿大，经检查显示需要进一步的检查、治疗或随访。"
        }
      ]
    }
  }else{
    data = {
      "list1": {
        "title": " 中老年抗癌计划",
        "subtitle": "胃癌、肝癌等各种癌症",
        "item_title": "",
        "item_con": "  为加入本计划，您需要查看被保障人是否符合加入要求。" +
        "若不符合以下要求，将不能加入计划。若您未如实告知其中任何一项情况，将来申请互助时，运营方将按规定拒绝您的申请。"
      }
      ,
      "title": "健康要求"
      ,
      "list2": [
        {
          "id": 1,
          "item_title": " 一、过去三年内，未曾因疾病进行手术治疗，或连续住院≧15天,或服药≧3个月;",
          "item_con": ""
        },
        {
          "id": 2,
          "item_title": "  二、目前或既往未患有以下重大疾病:",
          "item_con": " 肿瘤（包括恶性肿瘤、脑部肿瘤、白血病,但已经确诊为良性息肉、囊肿、结节和赘生物且已经治愈的外）、病理学描述为癌前病变的肿瘤、脑血管疾病、冠心病、心肌病、主动脉、急/慢性肾炎、慢性阻塞性肺疾病、支气管哮喘。"
        },
        {
          "id": 3,
          "item_title": "三、过去六个月，未曾出现下列不明原因的症状或不适:",
          "item_con": " 体重减轻超过5公斤（非健身或减肥原因）、不明原因的出血点或者淤块、反复鼻或牙龈出血,身体出现肿块、包块、结节、咯血、便血、血尿、淋巴结肿大，经检查显示需要进一步的检查、治疗或随访。"
        }
      ]
    }
  }

  return data
}
module.exports={
  mainData: mainData,
  intro1Data: intro1Data,
  healthData: healthData
}